content/photography/数码摄影基础.org
# -*- coding:utf-8-*-
#+TITLE: 数码摄影基础知识
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 概述

  摄影的基础知识主要是构图、光影、色彩。

* 构图基础

  构图是为了处理好拍摄画面的空间关系、光影关系和色彩关系，从而达到突出拍摄主体的目的。

  + 点：摄影作品中的点可以极大地吸引欣赏者的注意力。
  + 线：线条在画面中可以用于分割面，还可以引导欣赏者的视线，从而使画面产生动感与韵律感。
  + 面：面与面产生线，多面交叉还会产生点。面主要用于营造一种环境的真实感。

  基本概念：前景、背景、主体、陪体、留白。

  突出主体方法：
  + 将主体放在某些构图点上。
  + 通过对比：大小、远近、动静、虚实、明暗、色彩等。

  陪体的作用：
  + 映衬主体，使主体更明确，内容更丰富。
  + 均衡和美化画面。
  + 帮助摄影作品阐明情节，对画面叙事起推动作用。

  留白的作用：
  + 避免画面拥挤产生视觉疲劳。
  + 给欣赏者留下思考空间。


  前景的作用：
  + 烘托主体和装饰画面。
  + 有时还有过渡作用。

  背景的作用：
  + 衬托主体，说明环境，丰富画面内容。
  + 要简洁，避免杂乱。

  直幅构图的作品有高耸、强力、逼近之感。能强调主体本身的高度、力量感与气势。

  横幅构图有安静、深沉、宽广的感觉。

  拍摄视角：
  + 仰视：被摄对象看起来更高达、重要或有气势。
  + 平视：照片效果一般比较平稳安定。
  + 俯视：容易排除景物的高低落差，搭配广角和较大的物距，可以拍出广阔的空间感。会压缩画面中主体的视觉比例，产生夸张的大小对比。

* 构图法则
  + 黄金比例构图，完整的黄金比例构图，及其衍生的九宫格构图。
  + 三分法构图。
  + 视点构图，最灵活的构图法则，八点八线。
  + 对比法则
    + 虚实对比：景深
    + 大小对比：广角，透视，近小远大。
    + 远近对比：小光圈，大焦距。
    + 动静对比：高速快门
    + 明暗对比：注意曝光补偿
    + 色彩对比：
      + 互补色对比强调主体地位。
      + 相邻色对比强调画面的均衡和协调性。
      + 冷暖色对比表现画面的空间感。

  画面平衡：
  + 重量平衡：
  + 刚柔平衡
  + 色彩平衡
  + 视线平衡：用留白引导观赏者的视线。


  构图是减法：减掉影响主体表现力的景物。
  + 景深减法
  + 遮挡减法
  + 夸张减法（近小远大）

  构图是加法：加入陪体，让主体鲜明，画面生动。

* 构图形式
  + 水平线构图：稳定、和谐。
  + 竖直线构图：坚定、向上、永恒。
  + 对角线构图：动感、有活力。
  + s 形构图：延伸感、空间感。
  + 其他曲线构图。
  + 三角形构图：正三角安定、稳固、均衡。倒三角相反。
  + 圆形构图：均匀、团结、而定，但缺少视觉冲击力和变化。
  + 封闭式和开放式构图：开放式构图给人想象空间。
  + 放射式构图：汇集欣赏者注意力到主体。
  + 对称式构图：对称美。
  + 框景构图。

* 光的基本概念

** 光源
   + 直射光
   + 散射光
   + 反射光。

** 光的方向
   + 顺光
   + 斜射光
     + 摄影中主要用光方式。
     + 不仅适合表现被摄对象的轮廓，更能通过其阴影部分增加画面的明暗层次，让画面更立体。
   + 侧光
     + 明暗影调各一半，影子修长富有表现力。
     + 采用测光表现景物的立体感、表面质感和空间纵深感。
   + 逆光
     + 表现轮廓和剪影。
   + 顶光
     + 顶光一般不适合拍人像。
   + 脚光
     + 做修饰光使用，修饰人物的眼神、衣服或头发。
     + 拍摄水池、玻璃柜时，增加被摄物体的立体感和空间感。
   + 边缘光，云层

* 曝光与测光
  曝光三角：光圈，快门、ISO。

  测光原理：快门捕捉到的光线是整个环境总光亮的 18%，就是曝光值。

  测光方式：
  + 平均测光
  + 中央部分测光：只对画面中央的一片区域进行测光，测光区域约占画面 3%-11%。
    + 适合被摄主体位于画面的某一部分区域，并且该区域与周围环境光线相差较大。
    + 适合舞台、人像拍摄，也适合逆光拍摄。
  + 中央重点平均测光
    + 测光重点在画面中央，同时兼顾画面边缘。
  + 点测光
    + 对人物重点部分（如眼睛等）进行测光。

  曝光补偿：白加黑减。

  包围曝光。

  曝光锁定：防止测光完成后改变。

  曝光动态范围与直方图。

  曝光原则：宁欠勿过。

* 一天中各时段的光线特性
  色温：红低蓝高。

** 早晨
   早上的光线色彩比较浓郁，表现出或红或橙的色调。

   太阳上升快，色温也变化快，要注意及时调整色温，应该设定色温较高的白平衡。

** 上午
   上午的光线光源方向、质地和亮度比较稳定，8-10 点比较合适拍照。

   上午光线比较平淡，要从构图、光影、色彩等多方面进行考虑。

   上午是硬调光，强烈的光线照射在人物的脸上会显得刻板、枯燥，不建议上午拍摄人像。

   但是经过夜晚水汽的滋润，许多植物花草比较娇嫩、鲜艳，色彩表现力好，硬光富有层次，非常合适拍照风光题材。

   上午空气中的水汽和灰层会对光线产生反射和折射，偏振镜可以去除杂乱光线，是作品自然通透。

** 中午
   中午是顶光，不适合拍摄人物。但是这时段光线强烈，使得主体边缘将高光和阴影划分的十分明显，适合拍摄纪实题材。

   中午要拍照要注意曝光，对暗处曝光，并降低 1/2 或 1/3 的曝光补偿。

** 下午
   下午没有水汽，画面比较通透。

   午后，光线质感和色温变化稳定，适合拍照。

** 黄昏
   太阳落山之前，光线缓慢变弱，色温下降，呈现暖色调。

   晚霞和各种层云也是拍摄重点。

   这时候拍照要注意明暗对比。

** 夜晚
   刚入夜时的光影效果是自然光与人造光的结合，这时候可以排出很动人的效果。

   入夜以后使用快门与光圈的组合，可以拍出特殊效果：
   + 慢速快门拍车流
   + 小光圈拍星芒

   夜晚拍照要注意：
   + 使用三脚架
   + 白平衡模式准确。因为人造光不同。

* 光影的艺术

** 光线质感
   主体表面的纹理、材质与色彩非常清晰，就是质感较好。

   微距拍摄质感要求高，最好用三脚架，没有的话，可以提高 iso，缩短曝光时间。

** 不同的光影氛围

   高反差光影质感强烈，暗处或大片留白给欣赏者以联想。

   低反差光影平淡柔和，比较适合主体不是特别明确的风光题材。

** 情感表达
   硬调光通常表现强烈、明快、干净、纯洁等情感。

   软调光通常表现柔和、恬静或者惆怅、压抑的情感。

   高反差表现刚毅、肃穆、激昂的情感。

   低反差表现恬静、柔和、深邃、理智、枯燥、压抑以及孕育等情感。

** 阴影
   画面的立体感和空间大多是通过阴影的衬托才能表现出来。

   阴影还能提升画面美感。

** 边光

* 闪光灯的效果

  慢门同步功能。

* 认识色彩
  色彩的三属性：
  + 色相
  + 明度，同种或不同种色彩间的明暗差别。
  + 纯度，也就是色度，纯度高的颜色艳丽。


** 色系
   红色系：代表吉祥、喜气、热烈、奔放、激情、斗志、革命。

   橙色系：代表明亮、华丽、健康、活力、欢乐以及极度危险。

   黄色系：亮度高，给人感觉不稳定。有轻松、欢快的感觉。还有 代表高贵。但是土黄色给人稳重、踏实、柔和、轻松的感觉。

   绿色系：代表生机、朝气、希望、和平。

   蓝色系：大气、平静、稳重、理智、博大。

   紫色系：代表高贵、美丽、浪漫、神秘、孤独、忧郁。当代社会中，紫色具有强烈的女性化风格。

   白色：代表平等、平和、纯净、明亮、朴素、平淡、寒冷、冷库等。

   黑色：代表冷酷、阴暗、黑暗，也可象征高贵、神秘。

   黑白搭配给人强烈的视觉冲击力，蓝白搭配表现平和、宁静的情感。

   灰色是过渡色，用于调和极端对立的色彩。

** 色彩间的关系
   + 互补色
   + 相邻色
   + 暖色系
   + 冷色系

** 色彩运用技巧
